import React from 'react';
import PropTypes from 'prop-types';

const AboutUs = props => {
  return (
    <div className='container badge-white'>
      <h1 className='text-red large'>About Blood Source</h1>
      <br />
      <p>
        Blood Source একটি দৃঢ় ও সংকল্পবদ্ধ সংঘ বাংলাদেশের মানুষের জন্য। এই সংঘ
        মানুষের রক্তের প্রয়োজনে এগিয়ে আসে। এই সংঘে আছে আগ্রহী ও আত্মবিশ্বাসী
        মানুষের দল যারা মানুষের প্রয়োজনে রক্ত প্রদান করে থাকে এবং তাদের জীবনে
        বেঁচে থাকার জন্য এক মুখ্য ভূমিকা পালন করে থাকে। আমাদের এই সৎ ইচ্ছার দরুন
        সেই সব মানুষরা উৎসাহী হবে যারা কিনা মানব কল্যাণের জন্য সর্বদা নিবেদিত।
        আপনার মত মানুষ যারা এই মহৎ কাজে অংশ নিতে চায় তাদেরকে এই গ্রুপে আমন্ত্রণ
        করা আমাদের জন্য আনন্দ, সম্মান ও সৌভাগ্যের বিষয়। প্রতিদিন এই গ্রুপে বসে
        ভাল কাজের মেলা। যেকোনো শ্রেণির মানুষই আমাদের এই গ্রুপের অপরিহার্য অংশ।
        আমাদের উদ্দেশ্য হল সকল মহৎ যোধ্যাদের একই রাজ্যে আনা যেখানে প্রত্যেকে
        রক্তদানে ভূমিকা রাখতে পারে। একটি স্লোগান আছে যে, "একবিন্দু রক্ত তিনজন
        মানুষের জীবন বাঁচায়, কিন্তু একটি সুন্দর আচরণ লক্ষ লক্ষ লোকের মুখে হাঁসি
        ফুটিয়ে তুলে"। শুভ হোক সবার রক্তদানের প্রচেষ্টা 🙂
        <br />
        <br />
        Blood Source is a resolute community, in Bangladesh, to donate their
        blood to the people who are in need of it. This is a platform for an
        enthusiastic group of people who wishes to serve others by taking a key
        role in saving their lives. Consequently, this initiative will elevate
        inspiration to the people who always wanted to contribute to the
        betterment of human beings. This is our honour and privilege to welcome
        everyone who wishes to join our community where great things happen
        every day. People of a diverse background are an essential part of this
        community. The objective resides the intention to bring all the good
        souls in a single realm where each individual can take part in donating
        blood.
        <br />
        Just remember, "A single pint can save three lives, a single gesture can
        create a million smiles".
        <br />
        Happy "blood-donation" to all 🙂{' '}
      </p>
    </div>
  );
};

AboutUs.propTypes = {};

export default AboutUs;
