import React from 'react';
import { Link } from 'react-router-dom';
import PropTypes from 'prop-types';
import {
  Jumbotron,
  Image,
  Card,
  Button,
  Container,
  Row,
  Col
} from 'react-bootstrap';

const HowToDonate = props => {
  return (
    <div className='container text-deep landing-how'>
      <Card style={{ backgroundColor: '#fb0444' }}>
        <Card.Body>
          <Card.Title
            className='text-deep lead'
            style={{ textAlign: 'center', fontSize: '2em', color: '#ecf0f1' }}
          >
            রক্ত দাতা (Blood Donor) হওয়ার নিয়মাবলীঃ-
          </Card.Title>
          <Card.Text style={{ color: '#ecf0f1' }}>
            কিছু শর্ত রয়েছে যা কোনও ব্যক্তিকে অস্থায়ী বা স্থায়ীভাবে রক্তদান
            থেকে বাধা দেয়। অস্থায়ী শর্তগুলির মধ্যে রয়েছে: <br />
            <br />
            • গর্ভাবস্থা <br />• তীব্র জ্বর <br />• সাম্প্রতিক অ্যালকোহল খাওয়া{' '}
            <br />• কান বা দেহ ছিদ্র এবং উল্কি আকা। <br />• সার্জারি <br />
            <br />
            নিম্নলিখিত শর্তযুক্ত ব্যক্তিরা কোনওভাবেই রক্তদান করতে পারবেন না:{' '}
            <br />
            <br />• ক্যান্সার। <br />• কার্ডিয়াক ডিজিজ। <br />• ফুসফুসের অসহায়
            রোগ। <br />• হেপাটাইটিস বি এবং সি। <br />• এইচআইভি সংক্রমণ, এইডস বা
            যৌন সংক্রমণজনিত রোগ (এসটিডি) <br />• উচ্চ ঝুঁকি পেশা (উদাঃ
            পতিতাবৃত্তি) । <br />• অবজ্ঞাত ওজন হ্রাস 6 মাসের মধ্যে 5 কেজি বেশি ।{' '}
            <br />• দীর্ঘস্থায়ী মদ্যপান । <br />• অন্য যেসকল শর্ত বা রোগ যা
            রক্ত দাতাদের মেডিকেল অ্যাসেসমেন্টের গাইডে বর্ণিত রয়েছে। <br />
            <br />
            আমাদের রক্ত দাতা (Blood Donor)টিম এ যুক্ত হবার নিয়মঃ <br />
            একজন দাতা হিসাবে আপনাকে স্বাগতম।
            <br />
            <br />• Home Page থেকে <Link to='register'> Sign Up</Link> এ ক্লিক
            করুন। <br />• প্রত্যেকটি ঘর সটীক তথ্য দিয়ে পূরণ করুন। <br />• আপনার
            মোবাইল নম্বর এবং আপনার পাসওয়ার্ড খুব ই গুরুত্বপূর্ণ যেটা দিয়ে আপনি
            লগিন (Login) হতে পারবেন। <br />• Sign Up এর পরে আপনার Id টি Admin এর
            কাছে যাচাই এর জন্যে প্রেরণ করা হবে। আপনার Id টি Admin approve করলে
            আপনি Blood Source এর একজন proud donor হয়ে যাবেন। <br />• মনে রাকবেন
            আপনার Id তইরি হলে আপনার Available Status ‘Yes’ হয়ে যাবে। আপনি ওই
            সময়ে রক্ত দান করতে অক্ষম থাকলে Available Status ‘No’ করে দিতে ভুলবেন
            না এবং পরবর্তীতে “Yes” করে রাকুন জকন রক্ত দান করতে প্রস্তুত থাকবেন।{' '}
            <br />• আপনি আপনার Dashboard থেকে আপনার আসে পাসের যেসব মানুষের আপনার
            ব্লাড গ্রুপ এর রক্ত প্রয়োজন তাদের অ্যাপ্লিকেশান গুল দেকতে পারবেন।{' '}
            <br />• দয়া করে আপনার Facebook profile লিঙ্কটি দিয়ে আমাদের আপনাকে
            চিনতে সহযোগিতা করুন। এই তথ্য এডমিন ছাড়া আর কাউ দেকতে পারবে না।{' '}
            <br />
            <br />
            যে কোন ধরনের জিজ্ঞাশা থাকলে contact us এ ক্লিক করে আমাদের সাথে
            যোগাযোগ করুন। আমরা যত দ্রুত সম্ভব আপনার সাথে যোগাযোগ করব। <br />
            <br />
            মনব সেবাই আমাদের লক্ষ, আমাদের লক্ষ পুরনে আপনাদের সহযোগিতা একান্ত
            কাম্য।
          </Card.Text>
        </Card.Body>
      </Card>
    </div>
  );
};

HowToDonate.propTypes = {};

export default HowToDonate;
